Autodesk.Revit.DB.ResourceVersionStatus
An enum indicating whether a resource is current or out of date.

Autodesk.Revit.DB.ResourceVersionStatus.Unknown
It is not known whether the resource is current.

Autodesk.Revit.DB.ResourceVersionStatus.OutOfDate
This is not the most recent version of the resource.

Autodesk.Revit.DB.ResourceVersionStatus.Current
The resource is up-to-date; this is is the most recent version of the resource.